In [1]:
import pandas as pd
import numpy as np

In [3]:
date=pd.read_csv("orders.csv")
time=pd.read_csv("messages.csv")

In [4]:
date.sample(2)

           date  product_id  city_id  orders
720  2019-04-01        6212        7       3
327  2019-03-26        6115       22      63

In [5]:
time.sample(2)

                    date                                                msg
889  2015-10-09 01:49:00  Я люблю верховую езду.Парни  кто может поспосо...
755  2012-07-04 01:12:00  Обнаж М один дома ищу хочу Ж/Даму для встр!ммс...

# Working With Date

In [6]:
date["date"]=pd.to_datetime(date["date"]) # Changing datatype of date column

In [11]:
# 1: Fetching Year
date["year"]=date["date"].dt.year
date.sample(2)

          date  product_id  city_id  orders  year
504 2019-04-23        5280       23       8  2019
228 2019-05-15        6683       13       8  2019

In [13]:
# 2: Fatching Month
date["month_num"]=date["date"].dt.month
date.sample(2)

          date  product_id  city_id  orders  year  month  month_num
479 2019-10-11        5116       14      32  2019     10         10
140 2018-10-31        5112       10       1  2018     10         10

In [15]:
# 3: Fetching Month Name
date["month_name"]=date["date"].dt.month_name()
date.sample(2)

          date  product_id  city_id  orders  year  month  month_num month_name
319 2018-07-10        6283       14       2  2018      7          7       July
759 2019-11-23        6534       14       4  2019     11         11   November

In [19]:
# 4: Fatching Day
date["day_num"]=date["date"].dt.day
date.sample(2)

,date,product_id,city_id,orders,year,month,month_num,month_name,day_num
60,2018-08-05,3760,28,1,2018,8,8,August,5
872,2019-08-12,393,3,85,2019,8,8,August,12

In [20]:
# 5: Fetching Day Name
date["day_name"]=date["date"].dt.day_name()
date.sample(2)

,date,product_id,city_id,orders,year,month,month_num,month_name,day_num,day_name
735,2018-12-20,1445,9,60,2018,12,12,December,20,Thursday
201,2019-04-06,2357,14,104,2019,4,4,April,6,Saturday

In [34]:
# 6: Is_weekend?
date["is_weekend"]=np.where(date["day_name"].isin(["Saturday","Sunday"]),1,0)
date.sample(2)

,date,product_id,city_id,orders,year,month,month_num,month_name,day_num,day_name,is_weekend
712,2019-02-10,5290,3,8,2019,2,2,February,10,Sunday,1
490,2019-06-21,2254,16,4,2019,6,6,June,21,Friday,0

In [39]:
# 7: Fatching quarter
date["quarter"]=date["date"].dt.quarter
date.sample(2)

,date,product_id,city_id,orders,year,month,month_num,month_name,day_num,day_name,is_weekend,quarter
892,2019-12-07,1564,13,96,2019,12,12,December,7,Saturday,1,4
979,2019-08-19,2426,22,1,2019,8,8,August,19,Monday,0,3

# Working With Time

In [42]:
time.sample(2)

                    date                                                msg
50   2012-05-17 02:22:00  нормальный парень хочет познакомитса с хорошей...
785  2012-07-28 23:58:00                              М+М сейчас 0980024767

In [46]:
time["date"]=pd.to_datetime(time["date"])

In [48]:
# 1: Fatching Hours
time["hours"]=time["date"].dt.hour
time.sample(2)

                  date                                          msg  hours
14 2015-10-04 01:42:00                     парень ищет общения. 099      1
43 2013-11-16 23:46:00  Вы лучшие! нашел Девушку она делает всееее!     23

In [49]:
# 2: Fatching Minutes
time["minutes"]=time["date"].dt.minute
time.sample(2)

,date,msg,hours,minutes
727,2012-06-09 01:23:00,Користувач Гicть проголосував ЗА кліп Центр — ...,1,23
25,2014-06-03 01:01:00,М 41.185.75. Интересные Женщ. Есть? Дн-жинск...,1,1

In [50]:
# 3: Fatching Seconds
time["seconds"]=time["date"].dt.second
time.sample(2)

,date,msg,hours,minutes,seconds
711,2013-06-03 00:09:00,ПАРЕНЬ 30 ПОЗ С СЕМ. ПАРОЙ ДЛЯ ВСТРЕЧИ СЕЙЧАС ...,0,9,0
577,2014-04-24 23:00:00,я П ищу Д инт тел 0634733074 Днепр,23,0,0

In [52]:
# 4: Seprating Time from date column
time["time"]=time["date"].dt.time
time.sample(2)

,date,msg,hours,minutes,seconds,time
184,2013-07-02 22:41:00,дима аня,22,41,0,22:41:00
588,2012-05-03 01:16:00,симп паре 25лет поз с милой девушкой с/о 093 9...,1,16,0,01:16:00